{
  "id": "moviemaker-2026",
  "date": "2026-02-03",
  "title": "MovieMaker Rankings: OKC and Tulsa Top the List",
  "excerpt": "Both cities landed on MovieMaker Magazine's 2026 Top 25 Places to Live and Work as a Moviemaker—Tulsa at #18, OKC at #24 in the big cities category. Here's what that means for local talent.",
  "slug": "moviemaker-2026-okc-tulsa",
  "body": "<p>MovieMaker Magazine’s 2026 list of the best places to live and work as a moviemaker includes both Oklahoma City and Tulsa in the big cities category—Tulsa at #18 and Oklahoma City at #24. The list draws from cities across North America and is based on surveys, production spending, incentives, and site visits, so making the cut is a strong signal that the state’s film ecosystem is on the industry’s radar.</p><h2>Why OKC and Tulsa stand out</h2><p>Oklahoma City’s local film incentive launched in 2023 and has already driven big numbers: ten approved projects, about $78 million in direct spending in the city, and nearly $300 million in economic impact. The city offers rebates up to 10% that stack with the state program, and a recent bond locked in funding for the film office and rebate for the next decade. Major projects like “Twisters” and locally produced titles have put OKC on the map; Tulsa has drawn high-profile series and features as well, and with its new local incentive (stackable 5% rebate) the 918 is positioned for more growth.</p><h2>What it means for actors</h2><p>When a market shows up on a list like this, it usually means more productions are seriously considering it—and that often translates into more work for local talent. More projects in town don’t just mean more background work; they mean more principal and supporting roles cast locally, more recurring opportunities, and a deeper bench of crew and creatives. Keeping your materials current and staying visible (classes, networking, OKMPA Coffee with Crew) puts you in a better position as more projects choose Oklahoma.</p><p>For the full list, methodology, and MovieMaker’s write-ups on each city, see <a href=\"https://www.moviemaker.com/best-places-moviemaker-2026/\" target=\"_blank\" rel=\"noopener noreferrer\">MovieMaker Magazine’s Best Places to Live and Work as a Moviemaker in 2026</a>. For the Oklahoma Film + Music Office’s announcement and local quotes, see <a href=\"https://www.okfilmmusic.org/news/okc-tulsa-among-moviemaker-magazines-best-places-to-live-and-work-as-a-filmmaker\" target=\"_blank\" rel=\"noopener noreferrer\">Oklahoma Film + Music Office: OKC & Tulsa Among MovieMaker’s Best Places</a>.</p>"
}
