{
  "id": "tulsa-incentive-2026",
  "date": "2026-02-10",
  "title": "Hollywood on the Prairie: Tulsa Launches First-Ever Film Incentive",
  "excerpt": "Tulsa's new film incentive launched February 1, 2026—and it's stackable with state rebates. Here's why that's a big deal for actors in the 918.",
  "slug": "tulsa-film-incentive-2026",
  "body": "<p>On February 1, 2026, Tulsa launched its first-ever film incentive—and for actors and crew in the 918, it’s a game changer. The Tulsa Film Incentive is <strong>stackable</strong> with Oklahoma’s state rebate (the state Filmed in Oklahoma rebate) and other programs like the Cherokee Nation Film Incentive. More money back for productions means more projects choosing Tulsa, and that means more local casting calls.</p><h2>The basics</h2><p>The program is run by the Tulsa Office of Film, Music, Arts and Culture (TFMAC) and Tulsa Tourism, with $400,000 allocated annually. Productions that spend within the <strong>Tulsa Production Zone</strong> (a 30-mile radius from Tulsa City Hall) can qualify for a <strong>5% rebate</strong> on qualified spending:</p><ul><li><strong>Tier 1:</strong> Projects with qualified spending between $100,000 and $5 million (depending on project type) can receive up to $50,000.</li><li><strong>Tier 2:</strong> Projects with $5 million or more in qualified spending can receive up to $75,000.</li></ul><p>More than 50% of filming days must be in the Production Zone, and the main production office must be there. The rebate is based on qualifiers like hiring local crew (50%+ within the 45-mile Crew Zone), using local vendors, and local music. After wrap, an audit is required within 90 days; funds are disbursed after verification.</p><h2>Why it matters for actors</h2><p>When a production can stack Tulsa’s 5% on top of the state’s rebate (which can go up to 30% for qualifying projects), Tulsa becomes a more attractive “production zone” than cities without a local incentive. That doesn’t just mean more shoots—it means more <em>local</em> hiring. Casting directors and producers looking to maximize rebates have a clear reason to hire within the 918 area code and the surrounding crew zone.</p><p>Meg Gould, Executive Director of TFMAC, has said the goal is to make Tulsa “Hollywood on the Prairie”—with more industry jobs, a stronger local economy, and higher visibility for the city. Oklahoma Film + Music Office Director Jeanette Stanton has pointed to the state’s low cost of living and growing crew base as a draw; the new Tulsa incentive adds another reason for productions to choose Green Country.</p><h2>How to stay on the radar</h2><p>Applications are accepted on a quarterly basis. The first deadline was February 15, 2026; later deadlines are April 15, July 15, and October 15. For actors, the takeaway is simple: keep your materials updated, stay visible in the local scene (classes, OKMPA Coffee with Crew, networking), and watch for casting calls that list Tulsa or the Production Zone. The more productions that qualify for this rebate, the more opportunities will show up in your backyard.</p><p>For full details, eligibility, and applications, visit the <a href=\"https://www.visittulsa.com/film-music/film-incentives/tulsa-film-incentive/\" target=\"_blank\" rel=\"noopener noreferrer\">Tulsa Film Incentive</a> page at Visit Tulsa, and the <a href=\"https://www.okfilmmusic.org/news/tulsa-announces-citys-first-ever-film-incentive-program\" target=\"_blank\" rel=\"noopener noreferrer\">Oklahoma Film + Music Office announcement</a>.</p>"
}
